/**
 * 此方法判断数组中是否存在某个值，如果存在，则返回数组元素的下标，否则返回-1。
 */
Array.prototype.indexOf();

/**
 * 此方法判断数组中是否存在某个值，如果存在返回true，否则返回false
 */
Array.prototype.includes();

/**
 * 返回数组中满足条件的第一个元素的值，如果没有，返回undefined
 */
Array.prototype.find();

/**
 * 返回数组中满足条件的第一个元素的下标，如果没有找到，返回-1
 */
Array.prototype.findIndex();

/**
 * 参数:接受两个参数，一个是回调函数，一个是回调函数的this值(可选)。
 * 创建一个新数组，其结果是该数组中的每个元素都调用一个提供的函数后返回的结果
 * 对原来的数组没有影响
 *
 * 其中，回调函数被默认传入三个值，依次为当前元素、当前索引、整个数组。
 */
Array.prototype.map();

/**
 * 参数: 接收两个参数，一个为回调函数，另一个为初始值
 * 不传默认值会怎样?不传默认值会自动以第一个元素为初始值，然后从第二个元素开始依次累计。
 *
 * 回调函数中三个默认参数，依次为积累值、当前值、整个数组。
 */
Array.prototype.reduce();

/**
 * 参数: 一个函数参数。
 * 这个作为参数的函数返回值为一个布尔类型，决定元素是否保留。
 *
 * 这个函数接受一个默认参数，就是当前元素
 */
Array.prototype.filter();

/**
 * 个用于比较的函数，它有两个默认参数，分别是代表比较的两个元素。
 *
 * 就是比较函数不传的时候，是如何进行排序的？
 * 答案是将数字转换为字符串，然后根据字母unicode值进行升序排序，也就是根据字符串的比较规则进行升序排序。
 */
Array.prototype.sort();
